<?php

/*
	Є масив: 
	$temperatures = array(33, 15, 17, 20, 23, 23, 28, 40, 21, 19, 31, 18, 30, 31, 28, 23, 19, 28, 27, 30, 39, 17, 17, 20, 19, 23, 28, 30, 34, 28);
	Знайти три найменших значення, три найбільших і три середніх.
*/
	
function foo($t){
 sort($t);
 $sum = count($t);
 echo 'Три найменших значеннь' . $t[0] .' '. $t[1] .' '. $t[2] . '\n';
 
 echo 'Три найбільших значеннь' . $t[$sum-1] .' '. $t[$sum-2] .' '. $t[$sum-3] . '\n';
  
 echo 'Три середніх значеннь' . $t[$sum/2-1] .' '. $t[$sum/2] .' '. $t[$sum/2+1] . '\n';
}

$temperatures = array(
  33, 15, 17, 20, 23, 23, 28, 40, 
  21, 19, 31, 18, 30, 31, 28, 23, 
  19, 28, 27, 30, 39, 17, 17, 20, 
  19, 23, 28, 30, 34, 28);

foo($temperatures);
?>